app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT * FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("updated_at", "activity", "activity_abbreviation", "sort", "created_at") VALUES('2010-01-27 01:25:36', 'a new activity', 'new activ. abbr.', 2, '2010-01-27 01:25:36')

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT "activities".id FROM "activities" WHERE ("activities"."activity" = 'An example Preliminary Framework activity' AND "activities".id <> 980190962) LIMIT 1
UPDATE "activities" SET "sort" = 2, "activity" = 'updated activity', "updated_at" = '2010-01-27 01:25:36', "activity_abbreviation" = 'updated abbrev.' WHERE "id" = 980190962

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 980190962)
DELETE FROM "activities" WHERE "id" = 980190962