app/controllers/date_categories_controller.rb

SELECT * FROM "date_categories"
---
  def index
    @date_categories = DateCategory.all

SELECT * FROM "date_categories" WHERE ("date_categories"."id" = 980190962)
---
  def show
    @date_category = DateCategory.find(params[:id])

SELECT * FROM "date_categories" WHERE ("date_categories"."id" = 980190962)
---
  def edit
    @date_category = DateCategory.find(params[:id])

INSERT INTO "date_categories" ("updated_at", "date_category", "created_at") VALUES('2010-01-27 01:11:15', 'a new date category', '2010-01-27 01:11:15')
---
  def create
    @date_category = DateCategory.new(params[:date_category])

    respond_to do |format|
      if @date_category.save

SELECT "date_categories".id FROM "date_categories" WHERE ("date_categories"."date_category" = 'MyString' AND "date_categories".id <> 980190962) LIMIT 1
UPDATE "date_categories" SET "updated_at" = '2010-01-27 01:06:03', "date_category" = 'updated date category' WHERE "id" = 980190962
---
  def update
    @date_category = DateCategory.find(params[:id])

    respond_to do |format|
      if @date_category.update_attributes(params[:date_category])

SELECT * FROM "date_categories" WHERE ("date_categories"."id" = 980190962)
DELETE FROM "date_categories" WHERE "id" = 980190962
---
  def destroy
    @date_category = DateCategory.find(params[:id])
    @date_category.destroy