app/controllers/doe_project_managers_controller.rb

  def index
    @doe_project_managers = DoeProjectManager.all
---
SELECT * FROM "doe_project_managers"

  def show
    @doe_project_manager = DoeProjectManager.find(params[:id])
---
SELECT * FROM "doe_project_managers" WHERE ("doe_project_managers"."id" = 980190962)

  def edit
    @doe_project_manager = DoeProjectManager.find(params[:id])
---
SELECT * FROM "doe_project_managers" WHERE ("doe_project_managers"."id" = 980190962)

  def create
    @doe_project_manager = DoeProjectManager.new(params[:doe_project_manager])

    respond_to do |format|
      if @doe_project_manager.save
---
INSERT INTO "doe_project_managers" ("updated_at", "project_manager", "created_at") VALUES('2010-01-27 01:15:10', 'new project manager', '2010-01-27 01:15:10')

  def update
    @doe_project_manager = DoeProjectManager.find(params[:id])

    respond_to do |format|
      if @doe_project_manager.update_attributes(params[:doe_project_manager])
---
SELECT "doe_project_managers".id FROM "doe_project_managers" WHERE ("doe_project_managers"."project_manager" = 'MyString' AND "doe_project_managers".id <> 980190962) LIMIT 1
UPDATE "doe_project_managers" SET "project_manager" = 'updated manager', "updated_at" = '2010-01-27 01:15:10' WHERE "id" = 980190962

  def destroy
    @doe_project_manager = DoeProjectManager.find(params[:id])
    @doe_project_manager.destroy
---
SELECT * FROM "doe_project_managers" WHERE ("doe_project_managers"."id" = 980190962)
DELETE FROM "doe_project_managers" WHERE "id" = 980190962