app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT * FROM "drivers"

  def show
    @driver = Driver.find(params[:id])
---
SELECT * FROM "drivers" WHERE ("drivers"."id" = 980190962)

  def edit
    @driver = Driver.find(params[:id])
---
SELECT * FROM "drivers" WHERE ("drivers"."id" = 980190962)

  def create
    @driver = Driver.new(params[:driver])

    respond_to do |format|
      if @driver.save
---
INSERT INTO "drivers" ("updated_at", "driver", "created_at") VALUES('2010-01-27 01:12:51', 'new driver', '2010-01-27 01:12:51')

  def update
    @driver = Driver.find(params[:id])

    respond_to do |format|
      if @driver.update_attributes(params[:driver])
---
SELECT "drivers".id FROM "drivers" WHERE ("drivers"."driver" = 'EISA 2007' AND "drivers".id <> 980190962) LIMIT 1
UPDATE "drivers" SET "driver" = 'updated driver', "updated_at" = '2010-01-27 01:12:51' WHERE "id" = 980190962

  def destroy
    @driver = Driver.find(params[:id])
    @driver.destroy
---
SELECT * FROM "drivers" WHERE ("drivers"."id" = 980190962)
DELETE FROM "drivers" WHERE "id" = 980190962