app/controllers/milestones_controller.rb

SELECT * FROM "milestones"
---
  def index
    @milestones = Milestone.all

SELECT * FROM "milestones" WHERE ("milestones"."id" = 980190962)
---
  def show
    @milestone = Milestone.find(params[:id])

SELECT * FROM "milestones" WHERE ("milestones"."id" = 980190962)
---
  def edit
    @milestone = Milestone.find(params[:id])

INSERT INTO "milestones" ("date_category_id", "rulemaking_id", "updated_at", "phase_id", "activity_id", "milestone", "created_at") VALUES(5, 4, '2010-01-27 01:12:52', 2, 13, '2011-02-04 00:00:00', '2010-01-27 01:12:52')
---
  def create
    @milestone = Milestone.new(params[:milestone])

    respond_to do |format|
      if @milestone.save

SELECT * FROM "milestones" WHERE ("milestones"."id" = 980190962)
UPDATE "milestones" SET "activity_id" = 13, "phase_id" = 2, "rulemaking_id" = 15, "milestone" = '2011-02-04 00:00:00', "updated_at" = '2010-01-27 01:12:53', "date_category_id" = 5 WHERE "id" = 980190962
---
  def update
    @milestone = Milestone.find(params[:id])

    respond_to do |format|
      if @milestone.update_attributes(params[:milestone])

SELECT * FROM "milestones" WHERE ("milestones"."id" = 980190962)
DELETE FROM "milestones" WHERE "id" = 980190962
---
  def destroy
    @milestone = Milestone.find(params[:id])
    @milestone.destroy