app/controllers/phases_controller.rb

  def index
    @phases = Phase.all
---
SELECT * FROM "phases"

  def show
    @phase = Phase.find(params[:id])
---
SELECT * FROM "phases" WHERE ("phases"."id" = 980190962)

  def edit
    @phase = Phase.find(params[:id])
---
SELECT * FROM "phases" WHERE ("phases"."id" = 980190962)

  def create
    @phase = Phase.new(params[:phase])

    respond_to do |format|
      if @phase.save
---
INSERT INTO "phases" ("updated_at", "sort", "phase", "created_at") VALUES('2010-01-27 01:25:38', 4, '6. fake phase', '2010-01-27 01:25:38')

  def update
    @phase = Phase.find(params[:id])

    respond_to do |format|
      if @phase.update_attributes(params[:phase])
---
SELECT "phases".id FROM "phases" WHERE ("phases"."phase" = 'MyString' AND "phases".id <> 980190962) LIMIT 1
UPDATE "phases" SET "phase" = 'updated phase title', "sort" = 3, "updated_at" = '2010-01-27 01:25:39' WHERE "id" = 980190962

  def destroy
    @phase = Phase.find(params[:id])
    @phase.destroy
---
SELECT * FROM "phases" WHERE ("phases"."id" = 980190962)
DELETE FROM "phases" WHERE "id" = 980190962