app/controllers/rulemakings_controller.rb

SELECT * FROM "rulemakings"
---
  def index
    @search = Rulemaking.search(params[:search])

SELECT * FROM "rulemakings" WHERE ("rulemakings"."id" = 980190962)
SELECT * FROM "milestones" WHERE ("milestones".rulemaking_id = 980190962)
---
  def show
    @rulemaking = Rulemaking.find(params[:id])
    @revision_number = params[:revision_number] || Revision.maximum(:revision_number)
    @milestones = @rulemaking.milestones.find(:all, :conditions=> {:revision_number => @revision_number})

SELECT * FROM "rulemakings" WHERE ("rulemakings"."id" = 980190962)
---
  def edit
    @rulemaking = Rulemaking.find(params[:id])

INSERT INTO "rulemakings" ("updated_at", "phase_id", "activity_id", "notes", "doe_project_manager_id", "rule_type_id", "short_name", "rule", "legislative_deadline", "created_at") VALUES('2010-01-27 01:22:47', 2, 4, NULL, 4, 2, 'short name', 'mWO rulemaking', '2022-09-02 00:00:00', '2010-01-27 01:22:47')
---
  def create
    @rulemaking = Rulemaking.new(params[:rulemaking])

    respond_to do |format|
      if @rulemaking.save

SELECT * FROM "rulemakings" WHERE ("rulemakings"."id" = 980190962)
UPDATE "rulemakings" SET "activity_id" = 4, "legislative_deadline" = '2022-09-02 00:00:00', "phase_id" = 2, "short_name" = 'shorter name', "rule_type_id" = 3, "rule" = 'mWO rulemaking updated', "doe_project_manager_id" = 4, "updated_at" = '2010-01-27 01:32:19' WHERE "id" = 980190962
---
  def update
    params[:rulemaking][:contractor_ids] ||= []
    @rulemaking = Rulemaking.find(params[:id])

    respond_to do |format|
      if @rulemaking.update_attributes(params[:rulemaking])

SELECT * FROM "rulemakings" WHERE ("rulemakings"."id" = 980190962)
DELETE FROM "rulemakings" WHERE "id" = 980190962
---
  def destroy
    @rulemaking = Rulemaking.find(params[:id])
    @rulemaking.destroy