app/controllers/rule_types_controller.rb

  def index
    @rule_types = RuleType.all
---
SELECT * FROM "rule_types"

  def show
    @rule_type = RuleType.find(params[:id])
---
SELECT * FROM "rule_types" WHERE ("rule_types"."id" = 980190962)

  def edit
    @rule_type = RuleType.find(params[:id])
---
SELECT * FROM "rule_types" WHERE ("rule_types"."id" = 980190962)

  def create
    @rule_type = RuleType.new(params[:rule_type])

    respond_to do |format|
      if @rule_type.save
---
INSERT INTO "rule_types" ("updated_at", "rule_type", "rule_type_abbreviation", "created_at") VALUES('2010-01-27 01:15:13', 'Standard', 'STD', '2010-01-27 01:15:13')

  def update
    @rule_type = RuleType.find(params[:id])

    respond_to do |format|
      if @rule_type.update_attributes(params[:rule_type])
---
SELECT "rule_types".id FROM "rule_types" WHERE ("rule_types"."rule_type" = 'MyString' AND "rule_types".id <> 980190962) LIMIT 1
UPDATE "rule_types" SET "rule_type" = 'updated rule type', "rule_type_abbreviation" = 'abbrevi', "updated_at" = '2010-01-27 01:15:13' WHERE "id" = 980190962

  def destroy
    @rule_type = RuleType.find(params[:id])
    @rule_type.destroy
---
SELECT * FROM "rule_types" WHERE ("rule_types"."id" = 980190962)
DELETE FROM "rule_types" WHERE "id" = 980190962