app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "last", "remember_token_expires_at", "admin", "first", "remember_token", "organization", "login", "email", "created_at") VALUES('b538580e69431227f544f1415c74cc8380672345', '2010-02-25 17:31:40', 'b466924f984b6b3c7f15027d91c430e46856e948', NULL, NULL, NULL, NULL, NULL, NULL, 'guest', 'guest@example.com', '2010-02-25 17:31:40')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save